FAQ.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>FAQ</title>
<!-- 2016-01-02 lø. 11:38 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Martin" />
<link rel="stylesheet" type="text/css" href="sgvizler-www.css" />
</head>
<body>
<div id="content">
<h1 class="title">FAQ</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">SPARQL</a></li>
<li><a href="#sec-2">Browser support</a></li>
<li><a href="#sec-3">Server support</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">SPARQL</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">HTML encode characters</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Note that special characters like quotes and angle brackets in the
SPARQL query must be HTML encoded.
</p>

<p>
(Insert example using PREFIX, less than and quotes)
</p>
</div>
</div>

<div id="outline-container-casting-datatype" class="outline-3">
<h3 id="casting-datatype"><a id="sec-1-2" name="sec-1-2"></a>CASTing to correct datatype</h3>
<div class="outline-text-3" id="text-casting-datatype">

<p>
Many visualisation functions expect certain columns to be of a
specific datatype, e.g., number. If your data is not of the correct
type, you may want to try to cast the results into the required
type, e.g., 
</p>

<pre class="example">
   SELECT ?name (xsd:int(?untyped_value) as ?age) { 
      ?name a :Person ;
           :age ?untyped_value .
   }
</pre>

<p>
SPARQL standard reference:
<a href="http://www.w3.org/TR/2013/REC-sparql11-query-20130321/#FunctionMapping">http://www.w3.org/TR/2013/REC-sparql11-query-20130321/#FunctionMapping</a>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Browser support</h2>
<div class="outline-text-2" id="text-2">
<p>
In short, Sgvizler is supported by all modern browsers. Sgvizler uses
the jQuery javascript library, so check out their
<a href="http://docs.jquery.com/Browser_compatibility%20browser%20compatibility">http://docs.jquery.com/Browser_compatibility%20browser%20compatibility</a>,
and of course the charts rendered using the Google Visualization API
relies on it to work. Some of these charts require Flash, and SVG
technology to work, see Google's
<a href="http://code.google.com/apis/chart/interactive/docs/%20introduction%20to">http://code.google.com/apis/chart/interactive/docs/%20introduction%20to</a>.
</p>

<p>
In general JavaScript has to abide by the <a href="http://en.wikipedia.org/wiki/Same_origin_policy">same origin policy</a>, which
means that making ajax calls to external sites (which Sgvizler does if
it collects data from endpoints located at a different domain or port)
simply won't work. However, newer browsers, in this case Firefox 3.5,
Safari 4, Chrome 3 and IE 8, support all or enough of <a href="http://www.w3.org/TR/cors/">Cross-Origin
Resource Sharing</a> (CORS), which is a specification for such
communication, to make Sgvizler work as expected.
</p>

<p>
A way to circumvent the the origin policy is to use JSONP. Data
retrieved as JSONP is returned as a function call on the data in JSON
format, thus exploiting that the HTML {{{&lt;script&gt;}}} tag is not
required to respect the same origin policy. This, of course, requires
that the endpoint can return data in JSONP format, which many do.
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Known problem browsers</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>'''Android web browser, !WebKit/533.1''': The following charts does
not work, but are displayed as a text string only: gPieChart,
gBarChart, gAreaChart, gColumnChart, gLineChart, sScatterChart,
gTreeMap. The following charts seems to work: gGeoMap,
gMotionChart, gOrgChart, gTimeline, sMap, gTable, sList, sDefList,
sText.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">CORS support</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Quoting ssokolow from <a href="http://dev.opera.com/forums/topic/693452">http://dev.opera.com/forums/topic/693452</a>, which
is not inconsistent with what I've found:
</p>

<ul class="org-ul">
<li>Anything based on Gecko 1.9.1 or newer should support CORS (Firefox 3.5+).
</li>
<li>Anything based on a modern !WebKit should support CORS (Safari 4+, Chrome 5+, and Midori 0.2.7 tested OK).
</li>
<li>Internet Explorer 8 provides support via the XDomainRequest object but doesn't support credentialed requests.
</li>
<li>Opera 10.61 has no support for CORS. (Feature detection reports unsupported. The API isn't present.)
</li>
<li>Camino 2.0.5 (current) doesn't support CORS because it's based on Gecko 1.9.0 (Firefox 3.0's engine).
</li>
<li>Arora 0.10.2 (!QtWebKit) should support CORS, but it's broken due to a bug. (The API is there, so feature detection reports "supported", but requests fail.)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3">Tests</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">'''Browser'''</th>
<th scope="col" class="left">'''SOS'''</th>
<th scope="col" class="left">'''CORS'''</th>
<th scope="col" class="left">'''JSONP'''</th>
<th scope="col" class="left">'''Tested'''</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">Firefox 3.6</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">3.6.22</td>
</tr>

<tr>
<td class="left">Chrome 12</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">Chromium 12.0.742.112 (90304) Ubuntu 10.04</td>
</tr>

<tr>
<td class="left">Opera 11.51</td>
<td class="left">Yes</td>
<td class="left">'''No'''</td>
<td class="left">Yes</td>
<td class="left">Opera/9.80 (X11; Linux i686; U; en-GB) Presto/2.9.168 Version/11.51</td>
</tr>

<tr>
<td class="left">Internet Explorer 8</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">8.0.7600.16385</td>
</tr>

<tr>
<td class="left">Safari 5.1</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">Yes</td>
<td class="left">5.1 (6534.50)</td>
</tr>
</tbody>
</table>

<p>
(Legend: "SOS" = "Sgvizler same origin support", "CORS" = "Sgvizler CORS support".)
</p>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Server support</h2>
<div class="outline-text-2" id="text-3">
<p>
In order to CORS to work, in addition to browser support, the endpoint
server needs to be ''CORS enabled''.  This means that it must include
a parameter in the response header
with a value matching the address from which the request was sent&#x2014;or
a wildcard {{{*}}}, see
e.g. <a href="https://developer.mozilla.or/En/HTTP_access_control#Access-Control-Allow-Origin">https://developer.mozilla.or/En/HTTP_access_control#Access-Control-Allow-Origin</a>. You
can use e.g. <a href="http://getfirebug.com/%20Firebug">http://getfirebug.com/%20Firebug</a> to inspect the response
header to see if the server you are using is enabled.
</p>

<p>
If you administer an endpoint server, you should consider
<a href="http://enable-cors.org/%20enabling%20it%20for%20CORS">http://enable-cors.org/%20enabling%20it%20for%20CORS</a>. This link also contains
a list over resources which have CORS enabled.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Enabling CORS on Joseki</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Joseki has not enabled CORS (<a href="http://tech.groups.yahoo.com/group/jena-dev/message/45793">Read more in this thread</a>.), but it is
quite easy to do so. Find the file
{{{org/joseki/http/ResponseHttp.java}}} and the method ,
and add the line marked {{{// INSERT}}} in the code block below.
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #00ffff;">private</span> <span style="color: #98fb98;">void</span> <span style="color: #87cefa;">output</span>(<span style="color: #98fb98;">String</span> <span style="color: #eedd82;">contentType</span>, <span style="color: #98fb98;">String</span> <span style="color: #eedd82;">charset</span>, <span style="color: #98fb98;">OutputContent</span> <span style="color: #eedd82;">proc</span>)  <span style="color: #00ffff;">throws</span> <span style="color: #98fb98;">IOException</span>
    {
        ser.setHttpResponse(httpRequest, httpResponse, contentType, charset);
        httpResponse.setStatus(<span style="color: #7fffd4;">HttpServletResponse</span>.SC_OK) ;
        httpResponse.setHeader(Joseki.httpHeaderField, Joseki.httpHeaderValue);
    httpResponse.setHeader(<span style="color: #ffa07a;">"Access-Control-Allow-Origin"</span>, <span style="color: #ffa07a;">"*"</span>);              <span style="color: #ff7f24;">// </span><span style="color: #ff7f24;">INSERT</span>
        <span style="color: #98fb98;">ServletOutputStream</span> <span style="color: #eedd82;">out</span> = httpResponse.getOutputStream() ;
        proc.output(out) ;
        out.flush() ;
        httpResponse.flushBuffer();
    }
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Proxy</h3>
<div class="outline-text-3" id="text-3-2">
<p>
A workaround is to set up a proxy for your endpoint; php seems to be a
popular language for this.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
